Revit 2027 API
AirHeatingCoilType Enumeration
 The type of air heating coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AirHeatingCoilType
Public Enumeration AirHeatingCoilType
public enum class AirHeatingCoilType
type AirHeatingCoilType
Members
Member name | Value | Description
ElectricResistance | 1
Furnace | 2
HotWater | 3
None | 0
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace